stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATmega64HVE2.atdf                                          * 
 *   .ATDF File:   atdf/ATmega64HVE2.atdf                                     * 
 *   Version:      2.0.12                                                     * 
 *   Date:         2019-04-26                                                 * 
 *   Device:       ATmega64HVE2                                               * 
 *   Architecture: AVR8                                                       * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.12 2019-04-26 :                                                      * 
 *        - Added missing registers and corrceted event generator list for    * 
 *        - mega4809/4808/3209/3208/1609/1608/809/808.                        * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Succeeds Atmel.ATmega_DFP 1.3.300.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATmega64HVE2.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATmega64HVE2_H_INCLUDED
#  define _AVR_ATmega64HVE2_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define GPIOR0   _SFR_MEM8 (0x3E) /* General Purpose IO Register 0 */

#define GPIOR1   _SFR_MEM8 (0x4A) /* General Purpose IO Register 1 */
#define GPIOR2   _SFR_MEM8 (0x4B) /* General Purpose IO Register 2 */

#define SMCR     _SFR_MEM8 (0x53) /* Sleep Mode Control Register */
#define MCUSR    _SFR_MEM8 (0x54) /* MCU Status Register */
#define MCUCR    _SFR_MEM8 (0x55) /* MCU Control Register */

#define SP       _SFR_MEM16(0x5D) /* Stack Pointer  */
#define SREG     _SFR_MEM8 (0x5F) /* Status Register */

#define CLKPR    _SFR_MEM8 (0x61) /* Clock Prescale Register */

#define PRR0     _SFR_MEM8 (0x64) /* Power Reduction Register 0 */

#define SOSCCALA _SFR_MEM8 (0x66) /* Slow Oscillator Calibration Register A */
#define SOSCCALB _SFR_MEM8 (0x67) /* Oscillator Calibration Register B */

#define DIDR0    _SFR_MEM8 (0x7E) /* Digital Input Disable Register */

#define PLLCSR   _SFR_MEM8 (0xD8) /* PLL Control and Status Register */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t LOW; 
    register8_t HIGH;
} FUSE_t;


/* Watch-dog Timer always on */
typedef enum FUSE_WDTON_enum
{
    FUSE_WDTON_CLEAR_gc = (0x00), /* Watch-dog Timer always on - CLEAR */
    FUSE_WDTON_SET_gc   = (0x80), /* Watch-dog Timer always on - SET */
} FUSE_WDTON_t;

/* Preserve EEPROM through the Chip Erase cycle */
typedef enum FUSE_EESAVE_enum
{
    FUSE_EESAVE_CLEAR_gc = (0x00), /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
    FUSE_EESAVE_SET_gc   = (0x40), /* Preserve EEPROM through the Chip Erase cycle - SET */
} FUSE_EESAVE_t;

/* Serial program downloading (SPI) enabled */
typedef enum FUSE_SPIEN_enum
{
    FUSE_SPIEN_CLEAR_gc = (0x00), /* Serial program downloading (SPI) enabled - CLEAR */
    FUSE_SPIEN_SET_gc   = (0x20), /* Serial program downloading (SPI) enabled - SET */
} FUSE_SPIEN_t;

/* Brown-out detection enabled */
typedef enum FUSE_BODEN_enum
{
    FUSE_BODEN_CLEAR_gc = (0x00), /* Brown-out detection enabled - CLEAR */
    FUSE_BODEN_SET_gc   = (0x10), /* Brown-out detection enabled - SET */
} FUSE_BODEN_t;

/* Divide clock by 8 */
typedef enum FUSE_CKDIV8_enum
{
    FUSE_CKDIV8_CLEAR_gc = (0x00), /* Divide clock by 8 - CLEAR */
    FUSE_CKDIV8_SET_gc   = (0x08), /* Divide clock by 8 - SET */
} FUSE_CKDIV8_t;

/* Select start-up time */
typedef enum FUSE_SUT_enum
{
    FUSE_SUT_14CK_0MS_gc  = (0x00<<1), /* Start-up time 14 CK + 0 ms */
    FUSE_SUT_14CK_16MS_gc = (0x01<<1), /* Start-up time 14 CK + 16 ms */
    FUSE_SUT_14CK_32MS_gc = (0x02<<1), /* Start-up time 14 CK + 32 ms */
    FUSE_SUT_14CK_64MS_gc = (0x03<<1), /* Start-up time 14 CK + 64 ms */
} FUSE_SUT_t;

