stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/

typedef struct TC1_struct
{
    register8_t rsv_0x00[54]; /* RESERVED REGISTER BLOCK */
    register8_t TIFR1;        /* Timer/Counter Interrupt Flag register */
    register8_t rsv_0x37[12]; /* RESERVED REGISTER BLOCK */
    register8_t GTCCR;        /* General Timer/Counter Control Register */
    register8_t rsv_0x44[43]; /* RESERVED REGISTER BLOCK */
    register8_t TIMSK1;       /* Timer/Counter Interrupt Mask Register */
    register8_t rsv_0x70[16]; /* RESERVED REGISTER BLOCK */
    register8_t TCCR1A;       /* Timer/Counter 1 Control Register A */
    register8_t TCCR1B;       /* Timer/Counter1 Control Register B */
    register8_t rsv_0x82[2];  /* RESERVED REGISTER BLOCK */
    _REGISTER16 (TCNT1);      /* Timer Counter 1  Bytes */
    register8_t rsv_0x85[3];  /* RESERVED REGISTER BLOCK */
    register8_t OCR1A;        /* Output Compare Register 1A */
    register8_t OCR1B;        /* Output Compare Register B */
} TC1_t;


/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[53]; /* RESERVED REGISTER BLOCK */
    register8_t TIFR0;        /* Timer/Counter Interrupt Flag register */
    register8_t rsv_0x36[13]; /* RESERVED REGISTER BLOCK */
    register8_t GTCCR;        /* General Timer/Counter Control Register */
    register8_t TCCR0A;       /* Timer/Counter 0 Control Register A */
    register8_t TCCR0B;       /* Timer/Counter0 Control Register B */
    _REGISTER16 (TCNT0);      /* Timer Counter 0  Bytes */
    register8_t rsv_0x47;     /* RESERVED REGISTER */
    register8_t OCR0A;        /* Output Compare Register 0A */
    register8_t OCR0B;        /* Output Compare Register B */
    register8_t rsv_0x4A[36]; /* RESERVED REGISTER BLOCK */
    register8_t TIMSK0;       /* Timer/Counter Interrupt Mask Register */
} TC0_t;


/* Clock Select1 bis */
typedef enum TC1_CS_enum
{
    TC1_CS_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC1_CS_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC1_CS_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC1_CS_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC1_CS_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC1_CS_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC1_CS_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC1_CS_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC1_CS_t;

/* Timer/Counter Width */
typedef enum TC1_TCW1_enum
{
    TC1_TCW1_CLEAR_gc = (0x00), /* Timer/Counter Width - CLEAR */
    TC1_TCW1_SET_gc   = (0x80), /* Timer/Counter Width - SET */
} TC1_TCW1_t;

/* Input Capture Mode Enable */
typedef enum TC1_ICEN1_enum
{
    TC1_ICEN1_CLEAR_gc = (0x00), /* Input Capture Mode Enable - CLEAR */
    TC1_ICEN1_SET_gc   = (0x40), /* Input Capture Mode Enable - SET */
} TC1_ICEN1_t;

/* Input Capture Noise Canceler */
typedef enum TC1_ICNC1_enum
{
    TC1_ICNC1_CLEAR_gc = (0x00), /* Input Capture Noise Canceler - CLEAR */
    TC1_ICNC1_SET_gc   = (0x20), /* Input Capture Noise Canceler - SET */
} TC1_ICNC1_t;

/* Input Capture Edge Select */
typedef enum TC1_ICES1_enum
{
    TC1_ICES1_CLEAR_gc = (0x00), /* Input Capture Edge Select - CLEAR */
    TC1_ICES1_SET_gc   = (0x10), /* Input Capture Edge Select - SET */
} TC1_ICES1_t;

/* Input Capture Select */
typedef enum TC1_ICS1_enum
{
    TC1_ICS1_CLEAR_gc = (0x00), /* Input Capture Select - CLEAR */
    TC1_ICS1_SET_gc   = (0x08), /* Input Capture Select - SET */
} TC1_ICS1_t;

/* Waveform Generation Mode */
typedef enum TC1_WGM10_enum
{
    TC1_WGM10_CLEAR_gc = (0x00), /* Waveform Generation Mode - CLEAR */
    TC1_WGM10_SET_gc   = (0x01), /* Waveform Generation Mode - SET */
} TC1_WGM10_t;

/* Timer/Counter n Input Capture Interrupt Enable */
typedef enum TC1_ICIE1_enum
{
    TC1_ICIE1_CLEAR_gc = (0x00), /* Timer/Counter n Input Capture Interrupt Enable - CLEAR */
    TC1_ICIE1_SET_gc   = (0x08), /* Timer/Counter n Input Capture Interrupt Enable - SET */
} TC1_ICIE1_t;

/* Timer/Counter1 Output Compare B Interrupt Enable */
typedef enum TC1_OCIE1B_enum
{
    TC1_OCIE1B_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare B Interrupt Enable - CLEAR */
    TC1_OCIE1B_SET_gc   = (0x04), /* Timer/Counter1 Output Compare B Interrupt Enable - SET */
} TC1_OCIE1B_t;

/* Timer/Counter1 Output Compare A Interrupt Enable */
typedef enum TC1_OCIE1A_enum
{
    TC1_OCIE1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare A Interrupt Enable - CLEAR */
    TC1_OCIE1A_SET_gc   = (0x02), /* Timer/Counter1 Output Compare A Interrupt Enable - SET */
} TC1_OCIE1A_t;

/* Timer/Counter1 Overflow Interrupt Enable */
typedef enum TC1_TOIE1_enum
{
    TC1_TOIE1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
    TC1_TOIE1_SET_gc   = (0x01), /* Timer/Counter1 Overflow Interrupt Enable - SET */
} TC1_TOIE1_t;

/* Timer/Counter 1 Input Capture Flag */
typedef enum TC1_ICF1_enum
{
    TC1_ICF1_CLEAR_gc = (0x00), /* Timer/Counter 1 Input Capture Flag - CLEAR */
    TC1_ICF1_SET_gc   = (0x08), /* Timer/Counter 1 Input Capture Flag - SET */
} TC1_ICF1_t;

/* Timer/Counter1 Output Compare Flag B */
typedef enum TC1_OCF1B_enum
{
    TC1_OCF1B_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag B - CLEAR */
    TC1_OCF1B_SET_gc   = (0x04), /* Timer/Counter1 Output Compare Flag B - SET */
} TC1_OCF1B_t;

/* Timer/Counter1 Output Compare Flag A */
typedef enum TC1_OCF1A_enum
{
    TC1_OCF1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag A - CLEAR */
    TC1_OCF1A_SET_gc   = (0x02), /* Timer/Counter1 Output Compare Flag A - SET */
} TC1_OCF1A_t;

/* Timer/Counter1 Overflow Flag */
typedef enum TC1_TOV1_enum
{
    TC1_TOV1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Flag - CLEAR */
    TC1_TOV1_SET_gc   = (0x01), /* Timer/Counter1 Overflow Flag - SET */
} TC1_TOV1_t;

