stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* Port B Override Change Enable */
typedef enum PORTB_PBOVCE_enum
{
    PORTB_PBOVCE_CLEAR_gc = (0x00), /* Port B Override Change Enable - CLEAR */
    PORTB_PBOVCE_SET_gc   = (0x80), /* Port B Override Change Enable - SET */
} PORTB_PBOVCE_t;

/* Port B Override Enable 3 */
typedef enum PORTB_PBOE3_enum
{
    PORTB_PBOE3_CLEAR_gc = (0x00), /* Port B Override Enable 3 - CLEAR */
    PORTB_PBOE3_SET_gc   = (0x08), /* Port B Override Enable 3 - SET */
} PORTB_PBOE3_t;

/* Port B Override Enable 0 */
typedef enum PORTB_PBOE0_enum
{
    PORTB_PBOE0_CLEAR_gc = (0x00), /* Port B Override Enable 0 - CLEAR */
    PORTB_PBOE0_SET_gc   = (0x01), /* Port B Override Enable 0 - SET */
} PORTB_PBOE0_t;

/*
--------------------------------------------------------------------------------
BOOT_LOAD - Bootloader
--------------------------------------------------------------------------------
*/

typedef struct BOOT_LOAD_struct
{
    register8_t rsv_0x00[87]; /* RESERVED REGISTER BLOCK */
    register8_t SPMCSR;       /* Store Program Memory Control and Status Register */
} BOOT_LOAD_t;


/* SPM Interrupt Enable */
typedef enum BOOT_LOAD_SPMIE_enum
{
    BOOT_LOAD_SPMIE_CLEAR_gc = (0x00), /* SPM Interrupt Enable - CLEAR */
    BOOT_LOAD_SPMIE_SET_gc   = (0x80), /* SPM Interrupt Enable - SET */
} BOOT_LOAD_SPMIE_t;

/* Read-While-Write Section Busy */
typedef enum BOOT_LOAD_RWWSB_enum
{
    BOOT_LOAD_RWWSB_CLEAR_gc = (0x00), /* Read-While-Write Section Busy - CLEAR */
    BOOT_LOAD_RWWSB_SET_gc   = (0x40), /* Read-While-Write Section Busy - SET */
} BOOT_LOAD_RWWSB_t;

/* Signature Row Read */
typedef enum BOOT_LOAD_SIGRD_enum
{
    BOOT_LOAD_SIGRD_CLEAR_gc = (0x00), /* Signature Row Read - CLEAR */
    BOOT_LOAD_SIGRD_SET_gc   = (0x20), /* Signature Row Read - SET */
} BOOT_LOAD_SIGRD_t;

/* Read-While-Write Section Read Enable */
typedef enum BOOT_LOAD_RWWSRE_enum
{
    BOOT_LOAD_RWWSRE_CLEAR_gc = (0x00), /* Read-While-Write Section Read Enable - CLEAR */
    BOOT_LOAD_RWWSRE_SET_gc   = (0x10), /* Read-While-Write Section Read Enable - SET */
} BOOT_LOAD_RWWSRE_t;

/* Lock Bit Set */
typedef enum BOOT_LOAD_LBSET_enum
{
    BOOT_LOAD_LBSET_CLEAR_gc = (0x00), /* Lock Bit Set - CLEAR */
    BOOT_LOAD_LBSET_SET_gc   = (0x08), /* Lock Bit Set - SET */
} BOOT_LOAD_LBSET_t;

/* Page Write */
typedef enum BOOT_LOAD_PGWRT_enum
{
    BOOT_LOAD_PGWRT_CLEAR_gc = (0x00), /* Page Write - CLEAR */
    BOOT_LOAD_PGWRT_SET_gc   = (0x04), /* Page Write - SET */
} BOOT_LOAD_PGWRT_t;

/* Page Erase */
typedef enum BOOT_LOAD_PGERS_enum
{
    BOOT_LOAD_PGERS_CLEAR_gc = (0x00), /* Page Erase - CLEAR */
    BOOT_LOAD_PGERS_SET_gc   = (0x02), /* Page Erase - SET */
} BOOT_LOAD_PGERS_t;

/* Store Program Memory Enable */
typedef enum BOOT_LOAD_SPMEN_enum
{
    BOOT_LOAD_SPMEN_CLEAR_gc = (0x00), /* Store Program Memory Enable - CLEAR */
    BOOT_LOAD_SPMEN_SET_gc   = (0x01), /* Store Program Memory Enable - SET */
} BOOT_LOAD_SPMEN_t;

/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/

typedef struct ADC_struct
{
    register8_t rsv_0x00[224]; /* RESERVED REGISTER BLOCK */
    register8_t ADSCSRA;       /* ADC Synchronization Control and Status Register */
    register8_t ADSCSRB;       /* ADC Synchronization Control and Status Register */
    register8_t ADCRA;         /* ADC Control Register A */
    register8_t ADCRB;         /* ADC Control Register B */
    register8_t ADCRC;         /* ADC Control Register B */
    register8_t ADCRD;         /* ADC Control Register D */
    register8_t ADCRE;         /* ADC Control Register E */
    register8_t ADIFR;         /* ADC Interrupt Flag Register */
    register8_t ADIMR;         /* ADC Interrupt Mask Register */
    _REGISTER16 (CADRCL);      /* CC-ADC Regulator Current Comparator Threshold Level */
    register8_t rsv_0xEA;      /* RESERVED REGISTER */
    _REGISTER16 (CADIC);       /* C-ADC Instantaneous Conversion Result */
    register8_t rsv_0xEC;      /* RESERVED REGISTER */
    register8_t CADAC0;        /* C-ADC Accumulated Conversion Result */
    register8_t CADAC1;        /* C-ADC Accumulated Conversion Result */
    register8_t CADAC2;        /* C-ADC Accumulated Conversion Result */
    register8_t CADAC3;        /* C-ADC Accumulated Conversion Result */
    _REGISTER16 (VADIC);       /* V-ADC Instantaneous Conversion Result */
    register8_t rsv_0xF2;      /* RESERVED REGISTER */
    register8_t VADAC0;        /* V-ADC Accumulated Conversion Result */
    register8_t VADAC1;        /* V-ADC Accumulated Conversion Result */
    register8_t VADAC2;        /* V-ADC Accumulated Conversion Result */
    register8_t VADAC3;        /* V-ADC Accumulated Conversion Result */
} ADC_t;


/* Synchronization Busy */
typedef enum ADC_SBSY_enum
{
    ADC_SBSY_CLEAR_gc = (0x00), /* Synchronization Busy - CLEAR */
    ADC_SBSY_SET_gc   = (0x04), /* Synchronization Busy - SET */
} ADC_SBSY_t;

/* Synchronization Command */
typedef enum ADC_SCMD_enum
{
    ADC_SCMD_VAL_0x00_gc = (0x00), /* Reserved */
    ADC_SCMD_VAL_0x01_gc = (0x01), /* Reset and Synchronize */
    ADC_SCMD_VAL_0x02_gc = (0x02), /* Synchronize on next Instantaneous Conversion */
    ADC_SCMD_VAL_0x03_gc = (0x03), /* Synchronize on next Accumulated Conversion */
} ADC_SCMD_t;

/* V-ADC Instantaneous Conversion Polarity Status */
typedef enum ADC_VADICPS_enum
{
    ADC_VADICPS_CLEAR_gc = (0x00), /* V-ADC Instantaneous Conversion Polarity Status - CLEAR */
    ADC_VADICPS_SET_gc   = (0x40), /* V-ADC Instantaneous Conversion Polarity Status - SET */
} ADC_VADICPS_t;

/* VADAC Data Read Out Busy */
typedef enum ADC_VADACRB_enum
{
    ADC_VADACRB_CLEAR_gc = (0x00), /* VADAC Data Read Out Busy - CLEAR */
    ADC_VADACRB_SET_gc   = (0x20), /* VADAC Data Read Out Busy - SET */
} ADC_VADACRB_t;

/* VADIC Data Read Out Busy */
typedef enum ADC_VADICRB_enum
{
    ADC_VADICRB_CLEAR_gc = (0x00), /* VADIC Data Read Out Busy - CLEAR */
    ADC_VADICRB_SET_gc   = (0x10), /* VADIC Data Read Out Busy - SET */
} ADC_VADICRB_t;

