stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* C-ADC Instantaneous Conversion Polarity Status */
typedef enum ADC_CADICPS_enum
{
    ADC_CADICPS_CLEAR_gc = (0x00), /* C-ADC Instantaneous Conversion Polarity Status - CLEAR */
    ADC_CADICPS_SET_gc   = (0x04), /* C-ADC Instantaneous Conversion Polarity Status - SET */
} ADC_CADICPS_t;

/* CADAC Data Read Out Busy */
typedef enum ADC_CADACRB_enum
{
    ADC_CADACRB_CLEAR_gc = (0x00), /* CADAC Data Read Out Busy - CLEAR */
    ADC_CADACRB_SET_gc   = (0x02), /* CADAC Data Read Out Busy - SET */
} ADC_CADACRB_t;

/* CADIC Data Read Out Busy */
typedef enum ADC_CADICRB_enum
{
    ADC_CADICRB_CLEAR_gc = (0x00), /* CADIC Data Read Out Busy - CLEAR */
    ADC_CADICRB_SET_gc   = (0x01), /* CADIC Data Read Out Busy - SET */
} ADC_CADICRB_t;

/* ADC Polarity Select */
typedef enum ADC_ADPSEL_enum
{
    ADC_ADPSEL_CLEAR_gc = (0x00), /* ADC Polarity Select - CLEAR */
    ADC_ADPSEL_SET_gc   = (0x08), /* ADC Polarity Select - SET */
} ADC_ADPSEL_t;

/* C-ADC Chopper Mode Select */
typedef enum ADC_ADCMS_enum
{
    ADC_ADCMS_VAL_0x00_gc = (0x00<<1), /* Chopping Disabled */
    ADC_ADCMS_VAL_0x01_gc = (0x01<<1), /* Automatic Fast Chopping */
    ADC_ADCMS_VAL_0x02_gc = (0x02<<1), /* Automatic Slow Chopping */
    ADC_ADCMS_VAL_0x03_gc = (0x03<<1), /* Software Polarity Control */
} ADC_ADCMS_t;

/* Sampling Clock Select */
typedef enum ADC_CKSEL_enum
{
    ADC_CKSEL_VAL_0x00_gc = (0x00), /* PLL (512kHz output) as sampling clock */
    ADC_CKSEL_VAL_0x01_gc = (0x01), /* Slow RC Oscillator as sampling clock */
} ADC_CKSEL_t;

/* Instantaneous Decimation Ratio Select */
typedef enum ADC_ADIDES_enum
{
    ADC_ADIDES_VAL_0x00_gc = (0x00<<3), /* 512 */
    ADC_ADIDES_VAL_0x01_gc = (0x01<<3), /* 256 */
    ADC_ADIDES_VAL_0x02_gc = (0x02<<3), /* 128 */
    ADC_ADIDES_VAL_0x03_gc = (0x03<<3), /* 64 */
} ADC_ADIDES_t;

/* Accumulated Decimation Ratio Select */
typedef enum ADC_ADADES_enum
{
    ADC_ADADES_VAL_0x00_gc = (0x00), /* 512 */
    ADC_ADADES_VAL_0x01_gc = (0x01), /* 256 */
    ADC_ADADES_VAL_0x02_gc = (0x02), /* 128 */
    ADC_ADADES_VAL_0x03_gc = (0x03), /* 64 */
    ADC_ADADES_VAL_0x04_gc = (0x04), /* 32 */
    ADC_ADADES_VAL_0x05_gc = (0x05), /* 16 */
    ADC_ADADES_VAL_0x06_gc = (0x06), /* 8 */
    ADC_ADADES_VAL_0x07_gc = (0x07), /* 4 */
} ADC_ADADES_t;

/* C-ADC Enable */
typedef enum ADC_CADEN_enum
{
    ADC_CADEN_CLEAR_gc = (0x00), /* C-ADC Enable - CLEAR */
    ADC_CADEN_SET_gc   = (0x80), /* C-ADC Enable - SET */
} ADC_CADEN_t;

/* C-ADC Regular Current Comparator Mode */
typedef enum ADC_CADRCM_enum
{
    ADC_CADRCM_VAL_0x00_gc = (0x00<<4), /* Comparator Disabled */
    ADC_CADRCM_VAL_0x01_gc = (0x01<<4), /* Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and is reset if Accumulated Current is below threshold. */
    ADC_CADRCM_VAL_0x02_gc = (0x02<<4), /* Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and down if Accumulated Current is below threshold. */
    ADC_CADRCM_VAL_0x03_gc = (0x03<<4), /* Reserved */
} ADC_CADRCM_t;

/* C-ADC Regular Current Count Threshold */
typedef enum ADC_CADRCT_enum
{
    ADC_CADRCT_VAL_0x00_gc = (0x00), /* 1 */
    ADC_CADRCT_VAL_0x01_gc = (0x01), /* 2 */
    ADC_CADRCT_VAL_0x02_gc = (0x02), /* 3 */
    ADC_CADRCT_VAL_0x03_gc = (0x03), /* 4 */
    ADC_CADRCT_VAL_0x04_gc = (0x04), /* 5 */
    ADC_CADRCT_VAL_0x05_gc = (0x05), /* 6 */
    ADC_CADRCT_VAL_0x06_gc = (0x06), /* 7 */
    ADC_CADRCT_VAL_0x07_gc = (0x07), /* 8 */
    ADC_CADRCT_VAL_0x08_gc = (0x08), /* 9 */
    ADC_CADRCT_VAL_0x09_gc = (0x09), /* 10 */
    ADC_CADRCT_VAL_0x0a_gc = (0x0A), /* 11 */
    ADC_CADRCT_VAL_0x0b_gc = (0x0B), /* 12 */
    ADC_CADRCT_VAL_0x0c_gc = (0x0C), /* 13 */
    ADC_CADRCT_VAL_0x0d_gc = (0x0D), /* 14 */
    ADC_CADRCT_VAL_0x0e_gc = (0x0E), /* 15 */
    ADC_CADRCT_VAL_0x0f_gc = (0x0F), /* 16 */
} ADC_CADRCT_t;

/* C-ADC Gain */
typedef enum ADC_CADG_enum
{
    ADC_CADG_VAL_0x00_gc = (0x00<<3), /* 4x */
    ADC_CADG_VAL_0x01_gc = (0x01<<3), /* 8x */
    ADC_CADG_VAL_0x02_gc = (0x02<<3), /* 16x */
    ADC_CADG_VAL_0x03_gc = (0x03<<3), /* 32x */
    ADC_CADG_VAL_0x04_gc = (0x04<<3), /* 64x */
    ADC_CADG_VAL_0x05_gc = (0x05<<3), /* 128x */
    ADC_CADG_VAL_0x06_gc = (0x06<<3), /* 256x */
    ADC_CADG_VAL_0x07_gc = (0x07<<3), /* Reserved */
} ADC_CADG_t;

/* C-ADC Pin Diagnostics Mode */
typedef enum ADC_CADPDM_enum
{
    ADC_CADPDM_VAL_0x00_gc = (0x00<<1), /* No current source is enabled */
    ADC_CADPDM_VAL_0x01_gc = (0x01<<1), /* Current source on PI pin enabled */
    ADC_CADPDM_VAL_0x02_gc = (0x02<<1), /* Current source on NI pin enabled */
    ADC_CADPDM_VAL_0x03_gc = (0x03<<1), /* Current source on both PI/NI pins enabled */
} ADC_CADPDM_t;

/* C-ADC Diagnostics Channel Select */
typedef enum ADC_CADDSEL_enum
{
    ADC_CADDSEL_CLEAR_gc = (0x00), /* C-ADC Diagnostics Channel Select - CLEAR */
    ADC_CADDSEL_SET_gc   = (0x01), /* C-ADC Diagnostics Channel Select - SET */
} ADC_CADDSEL_t;

/* V-ADC Enable */
typedef enum ADC_VADEN_enum
{
    ADC_VADEN_CLEAR_gc = (0x00), /* V-ADC Enable - CLEAR */
    ADC_VADEN_SET_gc   = (0x80), /* V-ADC Enable - SET */
} ADC_VADEN_t;

/* V-ADC Reference Select */
typedef enum ADC_VADREFS_enum
{
    ADC_VADREFS_VAL_0x00_gc = (0x00<<5), /* VREF as reference */
    ADC_VADREFS_VAL_0x01_gc = (0x01<<5), /* AVDD/3 as reference (for diagnosis purpose) */
} ADC_VADREFS_t;

/* V-ADC Pin Diagnostics Mode */
typedef enum ADC_VADPDM_enum
{
    ADC_VADPDM_VAL_0x00_gc = (0x00<<3), /* No current source is enabled */
    ADC_VADPDM_VAL_0x01_gc = (0x01<<3), /* Current source on PV pin enabled */
    ADC_VADPDM_VAL_0x02_gc = (0x02<<3), /* Current source on NV pin enabled */
    ADC_VADPDM_VAL_0x03_gc = (0x03<<3), /* Current source on both PV/NV pins enabled */
} ADC_VADPDM_t;

/* V-ADC Channel Select */
typedef enum ADC_VADMUX_enum
{
    ADC_VADMUX_VAL_0x00_gc = (0x00), /* PV - NV */
    ADC_VADMUX_VAL_0x01_gc = (0x01), /* ADC0 - SGND */
    ADC_VADMUX_VAL_0x02_gc = (0x02), /* ADC1 - SGND */
    ADC_VADMUX_VAL_0x03_gc = (0x03), /* VTEMP - GND */
    ADC_VADMUX_VAL_0x04_gc = (0x04), /* DIAGNOSIS - GND (VREF/TBD) */
    ADC_VADMUX_VAL_0x05_gc = (0x05), /* Reserved */
    ADC_VADMUX_VAL_0x06_gc = (0x06), /* Reserved */
    ADC_VADMUX_VAL_0x07_gc = (0x07), /* Reserved */
} ADC_VADMUX_t;

