stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* V-ADC Accumulated Voltage Interrupt Flag */
typedef enum ADC_VADACIF_enum
{
    ADC_VADACIF_CLEAR_gc = (0x00), /* V-ADC Accumulated Voltage Interrupt Flag - CLEAR */
    ADC_VADACIF_SET_gc   = (0x20), /* V-ADC Accumulated Voltage Interrupt Flag - SET */
} ADC_VADACIF_t;

/* V-DAC Instantaneous Voltage Interrupt Flag */
typedef enum ADC_VADICIF_enum
{
    ADC_VADICIF_CLEAR_gc = (0x00), /* V-DAC Instantaneous Voltage Interrupt Flag - CLEAR */
    ADC_VADICIF_SET_gc   = (0x10), /* V-DAC Instantaneous Voltage Interrupt Flag - SET */
} ADC_VADICIF_t;

/* C-ADC Regulator Current Interrupt Flag */
typedef enum ADC_CADRCIF_enum
{
    ADC_CADRCIF_CLEAR_gc = (0x00), /* C-ADC Regulator Current Interrupt Flag - CLEAR */
    ADC_CADRCIF_SET_gc   = (0x04), /* C-ADC Regulator Current Interrupt Flag - SET */
} ADC_CADRCIF_t;

/* C-ADC Accumulated Current Interrupt Flag */
typedef enum ADC_CADACIF_enum
{
    ADC_CADACIF_CLEAR_gc = (0x00), /* C-ADC Accumulated Current Interrupt Flag - CLEAR */
    ADC_CADACIF_SET_gc   = (0x02), /* C-ADC Accumulated Current Interrupt Flag - SET */
} ADC_CADACIF_t;

/* C-ADC Instantaneous Current Interrupt Flag */
typedef enum ADC_CADICIF_enum
{
    ADC_CADICIF_CLEAR_gc = (0x00), /* C-ADC Instantaneous Current Interrupt Flag - CLEAR */
    ADC_CADICIF_SET_gc   = (0x01), /* C-ADC Instantaneous Current Interrupt Flag - SET */
} ADC_CADICIF_t;

/* V-ADC Accumulated Voltage Interrupt Enable */
typedef enum ADC_VADACIE_enum
{
    ADC_VADACIE_CLEAR_gc = (0x00), /* V-ADC Accumulated Voltage Interrupt Enable - CLEAR */
    ADC_VADACIE_SET_gc   = (0x20), /* V-ADC Accumulated Voltage Interrupt Enable - SET */
} ADC_VADACIE_t;

/* V-DAC Instantaneous Voltage Interrupt Enable */
typedef enum ADC_VADICIE_enum
{
    ADC_VADICIE_CLEAR_gc = (0x00), /* V-DAC Instantaneous Voltage Interrupt Enable - CLEAR */
    ADC_VADICIE_SET_gc   = (0x10), /* V-DAC Instantaneous Voltage Interrupt Enable - SET */
} ADC_VADICIE_t;

/* C-ADC Regulator Current Interrupt Enable */
typedef enum ADC_CADRCIE_enum
{
    ADC_CADRCIE_CLEAR_gc = (0x00), /* C-ADC Regulator Current Interrupt Enable - CLEAR */
    ADC_CADRCIE_SET_gc   = (0x04), /* C-ADC Regulator Current Interrupt Enable - SET */
} ADC_CADRCIE_t;

/* C-ADC Accumulated Current Interrupt Enable */
typedef enum ADC_CADACIE_enum
{
    ADC_CADACIE_CLEAR_gc = (0x00), /* C-ADC Accumulated Current Interrupt Enable - CLEAR */
    ADC_CADACIE_SET_gc   = (0x02), /* C-ADC Accumulated Current Interrupt Enable - SET */
} ADC_CADACIE_t;

/* C-ADC Instantaneous Current Interrupt Enable */
typedef enum ADC_CADICIE_enum
{
    ADC_CADICIE_CLEAR_gc = (0x00), /* C-ADC Instantaneous Current Interrupt Enable - CLEAR */
    ADC_CADICIE_SET_gc   = (0x01), /* C-ADC Instantaneous Current Interrupt Enable - SET */
} ADC_CADICIE_t;

/*
--------------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------------
*/

typedef struct BANDGAP_struct
{
    register8_t rsv_0x00[209]; /* RESERVED REGISTER BLOCK */
    register8_t BGCSRA;        /* Bandgap Control and Status Register A */
    register8_t BGCRB;         /* Band Gap Calibration Register B */
    register8_t BGCRA;         /* Band Gap Calibration Register A */
    register8_t BGLR;          /* Band Gap Lock Register */
} BANDGAP_t;


/* Band Gap Lock Enable */
typedef enum BANDGAP_BGPLE_enum
{
    BANDGAP_BGPLE_CLEAR_gc = (0x00), /* Band Gap Lock Enable - CLEAR */
    BANDGAP_BGPLE_SET_gc   = (0x02), /* Band Gap Lock Enable - SET */
} BANDGAP_BGPLE_t;

/* Band Gap Lock */
typedef enum BANDGAP_BGPL_enum
{
    BANDGAP_BGPL_CLEAR_gc = (0x00), /* Band Gap Lock - CLEAR */
    BANDGAP_BGPL_SET_gc   = (0x01), /* Band Gap Lock - SET */
} BANDGAP_BGPL_t;

/*
--------------------------------------------------------------------------------
LINUART - Local Interconnect Network
--------------------------------------------------------------------------------
*/

typedef struct LINUART_struct
{
    register8_t rsv_0x00[192]; /* RESERVED REGISTER BLOCK */
    register8_t LINCR;         /* LIN Control Register */
    register8_t LINSIR;        /* LIN Status and Interrupt Register */
    register8_t LINENIR;       /* LIN Enable Interrupt Register */
    register8_t LINERR;        /* LIN Error Register */
    register8_t LINBTR;        /* LIN Bit Timing Register */
    register8_t LINBRRL;       /* LIN Baud Rate Low Register */
    register8_t LINBRRH;       /* LIN Baud Rate High Register */
    register8_t LINDLR;        /* LIN Data Length Register */
    register8_t LINIDR;        /* LIN Identifier Register */
    register8_t LINSEL;        /* LIN Data Buffer Selection Register */
    register8_t LINDAT;        /* LIN Data Register */
} LINUART_t;


/* Software Reset */
typedef enum LINUART_LSWRES_enum
{
    LINUART_LSWRES_CLEAR_gc = (0x00), /* Software Reset - CLEAR */
    LINUART_LSWRES_SET_gc   = (0x80), /* Software Reset - SET */
} LINUART_LSWRES_t;

/* LIN Standard */
typedef enum LINUART_LIN13_enum
{
    LINUART_LIN13_CLEAR_gc = (0x00), /* LIN Standard - CLEAR */
    LINUART_LIN13_SET_gc   = (0x40), /* LIN Standard - SET */
} LINUART_LIN13_t;

/* LIN Configuration bits */
#define LINUART_LINCR_LCONF_gc(x) ((x<<4) & 0x30)

/* LIN or UART Enable */
typedef enum LINUART_LENA_enum
{
    LINUART_LENA_CLEAR_gc = (0x00), /* LIN or UART Enable - CLEAR */
    LINUART_LENA_SET_gc   = (0x08), /* LIN or UART Enable - SET */
} LINUART_LENA_t;

/* LIN Command and Mode bits */
#define LINUART_LINCR_LCMD_gc(x) (x & 0x07)

/* Identifier Status bits */
#define LINUART_LINSIR_LIDST_gc(x) ((x<<5) & 0xE0)

/* Busy Signal */
typedef enum LINUART_LBUSY_enum
{
    LINUART_LBUSY_CLEAR_gc = (0x00), /* Busy Signal - CLEAR */
    LINUART_LBUSY_SET_gc   = (0x10), /* Busy Signal - SET */
} LINUART_LBUSY_t;

/* Error Interrupt */
typedef enum LINUART_LERR_enum
{
    LINUART_LERR_CLEAR_gc = (0x00), /* Error Interrupt - CLEAR */
    LINUART_LERR_SET_gc   = (0x08), /* Error Interrupt - SET */
} LINUART_LERR_t;

