stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* Clock Prescaler Change Enable */
typedef enum CPU_CLKPCE_enum
{
    CPU_CLKPCE_CLEAR_gc = (0x00), /* Clock Prescaler Change Enable - CLEAR */
    CPU_CLKPCE_SET_gc   = (0x80), /* Clock Prescaler Change Enable - SET */
} CPU_CLKPCE_t;

/* Clock Prescaler Select Bits */
#define CPU_CLKPR_CLKPS_gc(x) (x & 0x03)

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[59]; /* RESERVED REGISTER BLOCK */
    register8_t PCIFR;        /* Pin Change Interrupt Flag Register */
    register8_t EIFR;         /* External Interrupt Flag Register */
    register8_t EIMSK;        /* External Interrupt Mask Register */
    register8_t rsv_0x3E[42]; /* RESERVED REGISTER BLOCK */
    register8_t PCICR;        /* Pin Change Interrupt Control Register */
    register8_t EICRA;        /* External Interrupt Control Register */
    register8_t rsv_0x6A;     /* RESERVED REGISTER */
    register8_t PCMSK0;       /* Pin Change Enable Mask Register 0 */
    register8_t PCMSK1;       /* Pin Change Enable Mask Register 1 */
} EXINT_t;


/* External Interrupt Sense Control 0 Bit 1 */
typedef enum EXINT_ISC01_enum
{
    EXINT_ISC01_CLEAR_gc = (0x00), /* External Interrupt Sense Control 0 Bit 1 - CLEAR */
    EXINT_ISC01_SET_gc   = (0x02), /* External Interrupt Sense Control 0 Bit 1 - SET */
} EXINT_ISC01_t;

/* External Interrupt Sense Control 0 Bit 0 */
typedef enum EXINT_ISC00_enum
{
    EXINT_ISC00_VAL_0x00_gc = (0x00), /* Low Level of INTX */
    EXINT_ISC00_VAL_0x01_gc = (0x01), /* Any Logical Change of INTX */
    EXINT_ISC00_VAL_0x02_gc = (0x02), /* Falling Edge of INTX */
    EXINT_ISC00_VAL_0x03_gc = (0x03), /* Rising Edge of INTX */
} EXINT_ISC00_t;

/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x01), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x01), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;

/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/

typedef struct WDT_struct
{
    register8_t rsv_0x00[96]; /* RESERVED REGISTER BLOCK */
    register8_t WDTCSR;       /* Watchdog Timer Control Register */
    register8_t rsv_0x61[2];  /* RESERVED REGISTER BLOCK */
    register8_t WDTCLR;       /* Watchdog Timer Configuration Lock Register */
} WDT_t;


/* Watchdog Timeout Interrupt Flag */
typedef enum WDT_WDIF_enum
{
    WDT_WDIF_CLEAR_gc = (0x00), /* Watchdog Timeout Interrupt Flag - CLEAR */
    WDT_WDIF_SET_gc   = (0x80), /* Watchdog Timeout Interrupt Flag - SET */
} WDT_WDIF_t;

/* Watchdog Timeout Interrupt Enable */
typedef enum WDT_WDIE_enum
{
    WDT_WDIE_CLEAR_gc = (0x00), /* Watchdog Timeout Interrupt Enable - CLEAR */
    WDT_WDIE_SET_gc   = (0x40), /* Watchdog Timeout Interrupt Enable - SET */
} WDT_WDIE_t;

/* Watchdog Timer Prescaler Bits */
typedef enum WDT_WDP_enum
{
    WDT_WDP_VAL_0x00_gc = (0x00), /* Oscillator Cycles 2K */
    WDT_WDP_VAL_0x01_gc = (0x01), /* Oscillator Cycles 4K */
    WDT_WDP_VAL_0x02_gc = (0x02), /* Oscillator Cycles 8K */
    WDT_WDP_VAL_0x03_gc = (0x03), /* Oscillator Cycles 16K */
    WDT_WDP_VAL_0x04_gc = (0x04), /* Oscillator Cycles 32K */
    WDT_WDP_VAL_0x05_gc = (0x05), /* Oscillator Cycles 64K */
    WDT_WDP_VAL_0x06_gc = (0x06), /* Oscillator Cycles 128K */
    WDT_WDP_VAL_0x07_gc = (0x07), /* Oscillator Cycles 256K */
    WDT_WDP_VAL_0x08_gc = (0x08), /* Oscillator Cycles 512K */
    WDT_WDP_VAL_0x09_gc = (0x09), /* Oscillator Cycles 1024K */
} WDT_WDP_t;

/* Watchdog Change Enable */
typedef enum WDT_WDCE_enum
{
    WDT_WDCE_CLEAR_gc = (0x00), /* Watchdog Change Enable - CLEAR */
    WDT_WDCE_SET_gc   = (0x10), /* Watchdog Change Enable - SET */
} WDT_WDCE_t;

/* Watch Dog Enable */
typedef enum WDT_WDE_enum
{
    WDT_WDE_CLEAR_gc = (0x00), /* Watch Dog Enable - CLEAR */
    WDT_WDE_SET_gc   = (0x08), /* Watch Dog Enable - SET */
} WDT_WDE_t;

/* Watchdog Timer Comfiguration Lock bits */
#define WDT_WDTCLR_WDCL_gc(x) ((x<<1) & 0x06)

/* Watchdog Timer Comfiguration Lock Enable */
typedef enum WDT_WDCLE_enum
{
    WDT_WDCLE_CLEAR_gc = (0x00), /* Watchdog Timer Comfiguration Lock Enable - CLEAR */
    WDT_WDCLE_SET_gc   = (0x01), /* Watchdog Timer Comfiguration Lock Enable - SET */
} WDT_WDCLE_t;

/*
--------------------------------------------------------------------------------
WAKEUP_TIMER - Wakeup Timer
--------------------------------------------------------------------------------
*/

typedef struct WAKEUP_TIMER_struct
{
    register8_t rsv_0x00[98]; /* RESERVED REGISTER BLOCK */
    register8_t WUTCSR;       /* Wake-up Timer Control and Status Register */
} WAKEUP_TIMER_t;


/* Wake-up Timer Interrupt Flag */
typedef enum WAKEUP_TIMER_WUTIF_enum
{
    WAKEUP_TIMER_WUTIF_CLEAR_gc = (0x00), /* Wake-up Timer Interrupt Flag - CLEAR */
    WAKEUP_TIMER_WUTIF_SET_gc   = (0x80), /* Wake-up Timer Interrupt Flag - SET */
} WAKEUP_TIMER_WUTIF_t;

/* Wake-up Timer Interrupt Enable */
typedef enum WAKEUP_TIMER_WUTIE_enum
{
    WAKEUP_TIMER_WUTIE_CLEAR_gc = (0x00), /* Wake-up Timer Interrupt Enable - CLEAR */
    WAKEUP_TIMER_WUTIE_SET_gc   = (0x40), /* Wake-up Timer Interrupt Enable - SET */
} WAKEUP_TIMER_WUTIE_t;

/* Wake-up Timer Reset */
typedef enum WAKEUP_TIMER_WUTR_enum
{
    WAKEUP_TIMER_WUTR_CLEAR_gc = (0x00), /* Wake-up Timer Reset - CLEAR */
    WAKEUP_TIMER_WUTR_SET_gc   = (0x10), /* Wake-up Timer Reset - SET */
} WAKEUP_TIMER_WUTR_t;

/* Wake-up Timer Enable */
typedef enum WAKEUP_TIMER_WUTE_enum
{
    WAKEUP_TIMER_WUTE_CLEAR_gc = (0x00), /* Wake-up Timer Enable - CLEAR */
    WAKEUP_TIMER_WUTE_SET_gc   = (0x08), /* Wake-up Timer Enable - SET */
} WAKEUP_TIMER_WUTE_t;

