stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* Wake-up Timer Prescaler Bits */
#define WAKEUP_TIMER_WUTCSR_WUTP_gc(x) (x & 0x07)
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define SPI          (*(SPI_t *) 0x0000)          /* Serial Peripheral Interface */
#define EEPROM       (*(EEPROM_t *) 0x0000)       /* EEPROM */
#define TC1          (*(TC1_t *) 0x0000)          /* Timer/Counter, 16-bit */
#define TC0          (*(TC0_t *) 0x0000)          /* Timer/Counter, 16-bit */
#define PORTB        (*(PORTB_t *) 0x0000)        /* I/O Port */
#define PORTA        (*(PORTA_t *) 0x0000)        /* I/O Port */
#define BOOT_LOAD    (*(BOOT_LOAD_t *) 0x0000)    /* Bootloader */
#define ADC          (*(ADC_t *) 0x0000)          /* Analog-to-Digital Converter */
#define BANDGAP      (*(BANDGAP_t *) 0x0000)      /* Bandgap */
#define LINUART      (*(LINUART_t *) 0x0000)      /* Local Interconnect Network */
#define CPU          (*(CPU_t *) 0x0000)          /* CPU Registers */
#define EXINT        (*(EXINT_t *) 0x0000)        /* External Interrupts */
#define WDT          (*(WDT_t *) 0x0000)          /* Watchdog Timer */
#define WAKEUP_TIMER (*(WAKEUP_TIMER_t *) 0x0000) /* Wakeup Timer */
#define FUSE         (*(FUSE_t *) 0x0000)         /* Fuses */
#define LOCKBIT      (*(LOCKBIT_t *) 0x0000)      /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* Watch-dog Timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watch-dog Timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x80) /* Watch-dog Timer always on - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x40) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Serial program downloading (SPI) enabled */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enabled - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x20) /* Serial program downloading (SPI) enabled - SET */


/* Brown-out detection enabled */
#define FUSE_BODEN_CLEAR_gc (0x00) /* Brown-out detection enabled - CLEAR */
#define FUSE_BODEN_SET_gc   (0x10) /* Brown-out detection enabled - SET */


/* Divide clock by 8 */
#define FUSE_CKDIV8_CLEAR_gc (0x00) /* Divide clock by 8 - CLEAR */
#define FUSE_CKDIV8_SET_gc   (0x08) /* Divide clock by 8 - SET */


/* Select start-up time */
#define FUSE_SUT_14CK_0MS_gc  (0x00<<1) /* Start-up time 14 CK + 0 ms */
#define FUSE_SUT_14CK_16MS_gc (0x01<<1) /* Start-up time 14 CK + 16 ms */
#define FUSE_SUT_14CK_32MS_gc (0x02<<1) /* Start-up time 14 CK + 32 ms */
#define FUSE_SUT_14CK_64MS_gc (0x03<<1) /* Start-up time 14 CK + 64 ms */


/* Oscillator select */
#define FUSE_OSCSEL0_CLEAR_gc (0x00) /* Oscillator select - CLEAR */
#define FUSE_OSCSEL0_SET_gc   (0x01) /* Oscillator select - SET */


/* Debug Wire enable */
#define FUSE_DWEN_CLEAR_gc (0x00) /* Debug Wire enable - CLEAR */
#define FUSE_DWEN_SET_gc   (0x08) /* Debug Wire enable - SET */


/* Select Boot Size */
#define FUSE_BOOTSZ_512W_7E00_gc  (0x03<<1) /* Boot Flash size=512 words Boot address=$7E00 */
#define FUSE_BOOTSZ_1024W_7C00_gc (0x02<<1) /* Boot Flash size=1024 words Boot address=$7C00 */
#define FUSE_BOOTSZ_2048W_7800_gc (0x01<<1) /* Boot Flash size=2048 words Boot address=$7800 */
#define FUSE_BOOTSZ_4096W_7000_gc (0x00<<1) /* Boot Flash size=4096 words Boot address=$7000 */


/* Boot Reset vector Enabled */
#define FUSE_BOOTRST_CLEAR_gc (0x00) /* Boot Reset vector Enabled - CLEAR */
#define FUSE_BOOTRST_SET_gc   (0x01) /* Boot Reset vector Enabled - SET */


/*
--------------------------------------------------------------------------------
LOCKBIT - Lockbits
--------------------------------------------------------------------------------
*/


/* Memory Lock */
#define LOCKBIT_LB_PROG_VER_DISABLED_gc (0x00) /* Further programming and verification disabled */
#define LOCKBIT_LB_PROG_DISABLED_gc     (0x02) /* Further programming disabled */
#define LOCKBIT_LB_NO_LOCK_gc           (0x03) /* No memory lock features enabled */


/* Boot Loader Protection Mode */
#define LOCKBIT_BLB0_LPM_SPM_DISABLE_gc (0x00<<2) /* LPM and SPM prohibited in Application Section */
#define LOCKBIT_BLB0_LPM_DISABLE_gc     (0x01<<2) /* LPM prohibited in Application Section */
#define LOCKBIT_BLB0_SPM_DISABLE_gc     (0x02<<2) /* SPM prohibited in Application Section */
#define LOCKBIT_BLB0_NO_LOCK_gc         (0x03<<2) /* No lock on SPM and LPM in Application Section */


/* Boot Loader Protection Mode */
#define LOCKBIT_BLB1_LPM_SPM_DISABLE_gc (0x00<<4) /* LPM and SPM prohibited in Boot Section */
#define LOCKBIT_BLB1_LPM_DISABLE_gc     (0x01<<4) /* LPM prohibited in Boot Section */
#define LOCKBIT_BLB1_SPM_DISABLE_gc     (0x02<<4) /* SPM prohibited in Boot Section */
#define LOCKBIT_BLB1_NO_LOCK_gc         (0x03<<4) /* No lock on SPM and LPM in Boot Section */


/*
--------------------------------------------------------------------------------
SPI - Serial Peripheral Interface
--------------------------------------------------------------------------------
*/


/* SPI Interrupt Enable */
#define SPI_SPIE_CLEAR_gc (0x00) /* SPI Interrupt Enable - CLEAR */
#define SPI_SPIE_SET_gc   (0x80) /* SPI Interrupt Enable - SET */


/* SPI Enable */
#define SPI_SPE_CLEAR_gc (0x00) /* SPI Enable - CLEAR */
#define SPI_SPE_SET_gc   (0x40) /* SPI Enable - SET */


/* Data Order */
#define SPI_DORD_CLEAR_gc (0x00) /* Data Order - CLEAR */
#define SPI_DORD_SET_gc   (0x20) /* Data Order - SET */


/* Master/Slave Select */
#define SPI_MSTR_CLEAR_gc (0x00) /* Master/Slave Select - CLEAR */
#define SPI_MSTR_SET_gc   (0x10) /* Master/Slave Select - SET */


/* Clock polarity */
#define SPI_CPOL_CLEAR_gc (0x00) /* Clock polarity - CLEAR */
#define SPI_CPOL_SET_gc   (0x08) /* Clock polarity - SET */


/* Clock Phase */
#define SPI_CPHA_CLEAR_gc (0x00) /* Clock Phase - CLEAR */
#define SPI_CPHA_SET_gc   (0x04) /* Clock Phase - SET */


/* SPI Clock Rate Selects */
#define SPI_SPR_VAL_0x00_gc (0x00) /* fosc/4 */
#define SPI_SPR_VAL_0x01_gc (0x01) /* fosc/16 */
#define SPI_SPR_VAL_0x02_gc (0x02) /* fosc/64 */
#define SPI_SPR_VAL_0x03_gc (0x03) /* fosc/128 */
#define SPI_SPR_VAL_0x04_gc (0x04) /* fosc/2 */
#define SPI_SPR_VAL_0x05_gc (0x05) /* fosc/8 */
#define SPI_SPR_VAL_0x06_gc (0x06) /* fosc/32 */
#define SPI_SPR_VAL_0x07_gc (0x07) /* fosc/64 */


/* SPI Interrupt Flag */
#define SPI_SPIF_CLEAR_gc (0x00) /* SPI Interrupt Flag - CLEAR */
#define SPI_SPIF_SET_gc   (0x80) /* SPI Interrupt Flag - SET */


