stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* Input Capture Edge Select */
#define TC0_ICES0_CLEAR_gc (0x00) /* Input Capture Edge Select - CLEAR */
#define TC0_ICES0_SET_gc   (0x10) /* Input Capture Edge Select - SET */


/* Input Capture Select */
#define TC0_ICS0_CLEAR_gc (0x00) /* Input Capture Select - CLEAR */
#define TC0_ICS0_SET_gc   (0x08) /* Input Capture Select - SET */


/* Waveform Generation Mode */
#define TC0_WGM00_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_WGM00_SET_gc   (0x01) /* Waveform Generation Mode - SET */


/* Timer/Counter n Input Capture Interrupt Enable */
#define TC0_ICIE0_CLEAR_gc (0x00) /* Timer/Counter n Input Capture Interrupt Enable - CLEAR */
#define TC0_ICIE0_SET_gc   (0x08) /* Timer/Counter n Input Capture Interrupt Enable - SET */


/* Timer/Counter0 Output Compare B Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare B Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x04) /* Timer/Counter0 Output Compare B Interrupt Enable - SET */


/* Timer/Counter0 Output Compare A Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare A Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare A Interrupt Enable - SET */


/* Timer/Counter0 Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x01) /* Timer/Counter0 Overflow Interrupt Enable - SET */


/* Timer/Counter 0 Input Capture Flag */
#define TC0_ICF0_CLEAR_gc (0x00) /* Timer/Counter 0 Input Capture Flag - CLEAR */
#define TC0_ICF0_SET_gc   (0x08) /* Timer/Counter 0 Input Capture Flag - SET */


/* Timer/Counter0 Output Compare Flag B */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag B - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Timer/Counter0 Output Compare Flag B - SET */


/* Timer/Counter0 Output Compare Flag A */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag A - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare Flag A - SET */


/* Timer/Counter0 Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x01) /* Timer/Counter0 Overflow Flag - SET */


/* Timer/Counter Synchronization Mode */
#define TC0_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC0_TSM_SET_gc   (0x80) /* Timer/Counter Synchronization Mode - SET */


/* Prescaler Reset */
#define TC0_PSRSYNC_CLEAR_gc (0x00) /* Prescaler Reset - CLEAR */
#define TC0_PSRSYNC_SET_gc   (0x01) /* Prescaler Reset - SET */


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/* Port B Override Change Enable */
#define PORTB_PBOVCE_CLEAR_gc (0x00) /* Port B Override Change Enable - CLEAR */
#define PORTB_PBOVCE_SET_gc   (0x80) /* Port B Override Change Enable - SET */


/* Port B Override Enable 3 */
#define PORTB_PBOE3_CLEAR_gc (0x00) /* Port B Override Enable 3 - CLEAR */
#define PORTB_PBOE3_SET_gc   (0x08) /* Port B Override Enable 3 - SET */


/* Port B Override Enable 0 */
#define PORTB_PBOE0_CLEAR_gc (0x00) /* Port B Override Enable 0 - CLEAR */
#define PORTB_PBOE0_SET_gc   (0x01) /* Port B Override Enable 0 - SET */


/*
--------------------------------------------------------------------------------
BOOT_LOAD - Bootloader
--------------------------------------------------------------------------------
*/


/* SPM Interrupt Enable */
#define BOOT_LOAD_SPMIE_CLEAR_gc (0x00) /* SPM Interrupt Enable - CLEAR */
#define BOOT_LOAD_SPMIE_SET_gc   (0x80) /* SPM Interrupt Enable - SET */


/* Read-While-Write Section Busy */
#define BOOT_LOAD_RWWSB_CLEAR_gc (0x00) /* Read-While-Write Section Busy - CLEAR */
#define BOOT_LOAD_RWWSB_SET_gc   (0x40) /* Read-While-Write Section Busy - SET */


/* Signature Row Read */
#define BOOT_LOAD_SIGRD_CLEAR_gc (0x00) /* Signature Row Read - CLEAR */
#define BOOT_LOAD_SIGRD_SET_gc   (0x20) /* Signature Row Read - SET */


/* Read-While-Write Section Read Enable */
#define BOOT_LOAD_RWWSRE_CLEAR_gc (0x00) /* Read-While-Write Section Read Enable - CLEAR */
#define BOOT_LOAD_RWWSRE_SET_gc   (0x10) /* Read-While-Write Section Read Enable - SET */


/* Lock Bit Set */
#define BOOT_LOAD_LBSET_CLEAR_gc (0x00) /* Lock Bit Set - CLEAR */
#define BOOT_LOAD_LBSET_SET_gc   (0x08) /* Lock Bit Set - SET */


/* Page Write */
#define BOOT_LOAD_PGWRT_CLEAR_gc (0x00) /* Page Write - CLEAR */
#define BOOT_LOAD_PGWRT_SET_gc   (0x04) /* Page Write - SET */


/* Page Erase */
#define BOOT_LOAD_PGERS_CLEAR_gc (0x00) /* Page Erase - CLEAR */
#define BOOT_LOAD_PGERS_SET_gc   (0x02) /* Page Erase - SET */


/* Store Program Memory Enable */
#define BOOT_LOAD_SPMEN_CLEAR_gc (0x00) /* Store Program Memory Enable - CLEAR */
#define BOOT_LOAD_SPMEN_SET_gc   (0x01) /* Store Program Memory Enable - SET */


/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/


/* Synchronization Busy */
#define ADC_SBSY_CLEAR_gc (0x00) /* Synchronization Busy - CLEAR */
#define ADC_SBSY_SET_gc   (0x04) /* Synchronization Busy - SET */


/* Synchronization Command */
#define ADC_SCMD_VAL_0x00_gc (0x00) /* Reserved */
#define ADC_SCMD_VAL_0x01_gc (0x01) /* Reset and Synchronize */
#define ADC_SCMD_VAL_0x02_gc (0x02) /* Synchronize on next Instantaneous Conversion */
#define ADC_SCMD_VAL_0x03_gc (0x03) /* Synchronize on next Accumulated Conversion */


/* V-ADC Instantaneous Conversion Polarity Status */
#define ADC_VADICPS_CLEAR_gc (0x00) /* V-ADC Instantaneous Conversion Polarity Status - CLEAR */
#define ADC_VADICPS_SET_gc   (0x40) /* V-ADC Instantaneous Conversion Polarity Status - SET */


/* VADAC Data Read Out Busy */
#define ADC_VADACRB_CLEAR_gc (0x00) /* VADAC Data Read Out Busy - CLEAR */
#define ADC_VADACRB_SET_gc   (0x20) /* VADAC Data Read Out Busy - SET */


