stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* VADIC Data Read Out Busy */
#define ADC_VADICRB_CLEAR_gc (0x00) /* VADIC Data Read Out Busy - CLEAR */
#define ADC_VADICRB_SET_gc   (0x10) /* VADIC Data Read Out Busy - SET */


/* C-ADC Instantaneous Conversion Polarity Status */
#define ADC_CADICPS_CLEAR_gc (0x00) /* C-ADC Instantaneous Conversion Polarity Status - CLEAR */
#define ADC_CADICPS_SET_gc   (0x04) /* C-ADC Instantaneous Conversion Polarity Status - SET */


/* CADAC Data Read Out Busy */
#define ADC_CADACRB_CLEAR_gc (0x00) /* CADAC Data Read Out Busy - CLEAR */
#define ADC_CADACRB_SET_gc   (0x02) /* CADAC Data Read Out Busy - SET */


/* CADIC Data Read Out Busy */
#define ADC_CADICRB_CLEAR_gc (0x00) /* CADIC Data Read Out Busy - CLEAR */
#define ADC_CADICRB_SET_gc   (0x01) /* CADIC Data Read Out Busy - SET */


/* ADC Polarity Select */
#define ADC_ADPSEL_CLEAR_gc (0x00) /* ADC Polarity Select - CLEAR */
#define ADC_ADPSEL_SET_gc   (0x08) /* ADC Polarity Select - SET */


/* C-ADC Chopper Mode Select */
#define ADC_ADCMS_VAL_0x00_gc (0x00<<1) /* Chopping Disabled */
#define ADC_ADCMS_VAL_0x01_gc (0x01<<1) /* Automatic Fast Chopping */
#define ADC_ADCMS_VAL_0x02_gc (0x02<<1) /* Automatic Slow Chopping */
#define ADC_ADCMS_VAL_0x03_gc (0x03<<1) /* Software Polarity Control */


/* Sampling Clock Select */
#define ADC_CKSEL_VAL_0x00_gc (0x00) /* PLL (512kHz output) as sampling clock */
#define ADC_CKSEL_VAL_0x01_gc (0x01) /* Slow RC Oscillator as sampling clock */


/* Instantaneous Decimation Ratio Select */
#define ADC_ADIDES_VAL_0x00_gc (0x00<<3) /* 512 */
#define ADC_ADIDES_VAL_0x01_gc (0x01<<3) /* 256 */
#define ADC_ADIDES_VAL_0x02_gc (0x02<<3) /* 128 */
#define ADC_ADIDES_VAL_0x03_gc (0x03<<3) /* 64 */


/* Accumulated Decimation Ratio Select */
#define ADC_ADADES_VAL_0x00_gc (0x00) /* 512 */
#define ADC_ADADES_VAL_0x01_gc (0x01) /* 256 */
#define ADC_ADADES_VAL_0x02_gc (0x02) /* 128 */
#define ADC_ADADES_VAL_0x03_gc (0x03) /* 64 */
#define ADC_ADADES_VAL_0x04_gc (0x04) /* 32 */
#define ADC_ADADES_VAL_0x05_gc (0x05) /* 16 */
#define ADC_ADADES_VAL_0x06_gc (0x06) /* 8 */
#define ADC_ADADES_VAL_0x07_gc (0x07) /* 4 */


/* C-ADC Enable */
#define ADC_CADEN_CLEAR_gc (0x00) /* C-ADC Enable - CLEAR */
#define ADC_CADEN_SET_gc   (0x80) /* C-ADC Enable - SET */


/* C-ADC Regular Current Comparator Mode */
#define ADC_CADRCM_VAL_0x00_gc (0x00<<4) /* Comparator Disabled */
#define ADC_CADRCM_VAL_0x01_gc (0x01<<4) /* Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and is reset if Accumulated Current is below threshold. */
#define ADC_CADRCM_VAL_0x02_gc (0x02<<4) /* Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and down if Accumulated Current is below threshold. */
#define ADC_CADRCM_VAL_0x03_gc (0x03<<4) /* Reserved */


/* C-ADC Regular Current Count Threshold */
#define ADC_CADRCT_VAL_0x00_gc (0x00) /* 1 */
#define ADC_CADRCT_VAL_0x01_gc (0x01) /* 2 */
#define ADC_CADRCT_VAL_0x02_gc (0x02) /* 3 */
#define ADC_CADRCT_VAL_0x03_gc (0x03) /* 4 */
#define ADC_CADRCT_VAL_0x04_gc (0x04) /* 5 */
#define ADC_CADRCT_VAL_0x05_gc (0x05) /* 6 */
#define ADC_CADRCT_VAL_0x06_gc (0x06) /* 7 */
#define ADC_CADRCT_VAL_0x07_gc (0x07) /* 8 */
#define ADC_CADRCT_VAL_0x08_gc (0x08) /* 9 */
#define ADC_CADRCT_VAL_0x09_gc (0x09) /* 10 */
#define ADC_CADRCT_VAL_0x0a_gc (0x0A) /* 11 */
#define ADC_CADRCT_VAL_0x0b_gc (0x0B) /* 12 */
#define ADC_CADRCT_VAL_0x0c_gc (0x0C) /* 13 */
#define ADC_CADRCT_VAL_0x0d_gc (0x0D) /* 14 */
#define ADC_CADRCT_VAL_0x0e_gc (0x0E) /* 15 */
#define ADC_CADRCT_VAL_0x0f_gc (0x0F) /* 16 */


/* C-ADC Gain */
#define ADC_CADG_VAL_0x00_gc (0x00<<3) /* 4x */
#define ADC_CADG_VAL_0x01_gc (0x01<<3) /* 8x */
#define ADC_CADG_VAL_0x02_gc (0x02<<3) /* 16x */
#define ADC_CADG_VAL_0x03_gc (0x03<<3) /* 32x */
#define ADC_CADG_VAL_0x04_gc (0x04<<3) /* 64x */
#define ADC_CADG_VAL_0x05_gc (0x05<<3) /* 128x */
#define ADC_CADG_VAL_0x06_gc (0x06<<3) /* 256x */
#define ADC_CADG_VAL_0x07_gc (0x07<<3) /* Reserved */


/* C-ADC Pin Diagnostics Mode */
#define ADC_CADPDM_VAL_0x00_gc (0x00<<1) /* No current source is enabled */
#define ADC_CADPDM_VAL_0x01_gc (0x01<<1) /* Current source on PI pin enabled */
#define ADC_CADPDM_VAL_0x02_gc (0x02<<1) /* Current source on NI pin enabled */
#define ADC_CADPDM_VAL_0x03_gc (0x03<<1) /* Current source on both PI/NI pins enabled */


/* C-ADC Diagnostics Channel Select */
#define ADC_CADDSEL_CLEAR_gc (0x00) /* C-ADC Diagnostics Channel Select - CLEAR */
#define ADC_CADDSEL_SET_gc   (0x01) /* C-ADC Diagnostics Channel Select - SET */


/* V-ADC Enable */
#define ADC_VADEN_CLEAR_gc (0x00) /* V-ADC Enable - CLEAR */
#define ADC_VADEN_SET_gc   (0x80) /* V-ADC Enable - SET */


/* V-ADC Reference Select */
#define ADC_VADREFS_VAL_0x00_gc (0x00<<5) /* VREF as reference */
#define ADC_VADREFS_VAL_0x01_gc (0x01<<5) /* AVDD/3 as reference (for diagnosis purpose) */


/* V-ADC Pin Diagnostics Mode */
#define ADC_VADPDM_VAL_0x00_gc (0x00<<3) /* No current source is enabled */
#define ADC_VADPDM_VAL_0x01_gc (0x01<<3) /* Current source on PV pin enabled */
#define ADC_VADPDM_VAL_0x02_gc (0x02<<3) /* Current source on NV pin enabled */
#define ADC_VADPDM_VAL_0x03_gc (0x03<<3) /* Current source on both PV/NV pins enabled */


/* V-ADC Channel Select */
#define ADC_VADMUX_VAL_0x00_gc (0x00) /* PV - NV */
#define ADC_VADMUX_VAL_0x01_gc (0x01) /* ADC0 - SGND */
#define ADC_VADMUX_VAL_0x02_gc (0x02) /* ADC1 - SGND */
#define ADC_VADMUX_VAL_0x03_gc (0x03) /* VTEMP - GND */
#define ADC_VADMUX_VAL_0x04_gc (0x04) /* DIAGNOSIS - GND (VREF/TBD) */
#define ADC_VADMUX_VAL_0x05_gc (0x05) /* Reserved */
#define ADC_VADMUX_VAL_0x06_gc (0x06) /* Reserved */
#define ADC_VADMUX_VAL_0x07_gc (0x07) /* Reserved */


/* V-ADC Accumulated Voltage Interrupt Flag */
#define ADC_VADACIF_CLEAR_gc (0x00) /* V-ADC Accumulated Voltage Interrupt Flag - CLEAR */
#define ADC_VADACIF_SET_gc   (0x20) /* V-ADC Accumulated Voltage Interrupt Flag - SET */


/* V-DAC Instantaneous Voltage Interrupt Flag */
#define ADC_VADICIF_CLEAR_gc (0x00) /* V-DAC Instantaneous Voltage Interrupt Flag - CLEAR */
#define ADC_VADICIF_SET_gc   (0x10) /* V-DAC Instantaneous Voltage Interrupt Flag - SET */


