stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* C-ADC Regulator Current Interrupt Flag */
#define ADC_CADRCIF_CLEAR_gc (0x00) /* C-ADC Regulator Current Interrupt Flag - CLEAR */
#define ADC_CADRCIF_SET_gc   (0x04) /* C-ADC Regulator Current Interrupt Flag - SET */


/* C-ADC Accumulated Current Interrupt Flag */
#define ADC_CADACIF_CLEAR_gc (0x00) /* C-ADC Accumulated Current Interrupt Flag - CLEAR */
#define ADC_CADACIF_SET_gc   (0x02) /* C-ADC Accumulated Current Interrupt Flag - SET */


/* C-ADC Instantaneous Current Interrupt Flag */
#define ADC_CADICIF_CLEAR_gc (0x00) /* C-ADC Instantaneous Current Interrupt Flag - CLEAR */
#define ADC_CADICIF_SET_gc   (0x01) /* C-ADC Instantaneous Current Interrupt Flag - SET */


/* V-ADC Accumulated Voltage Interrupt Enable */
#define ADC_VADACIE_CLEAR_gc (0x00) /* V-ADC Accumulated Voltage Interrupt Enable - CLEAR */
#define ADC_VADACIE_SET_gc   (0x20) /* V-ADC Accumulated Voltage Interrupt Enable - SET */


/* V-DAC Instantaneous Voltage Interrupt Enable */
#define ADC_VADICIE_CLEAR_gc (0x00) /* V-DAC Instantaneous Voltage Interrupt Enable - CLEAR */
#define ADC_VADICIE_SET_gc   (0x10) /* V-DAC Instantaneous Voltage Interrupt Enable - SET */


/* C-ADC Regulator Current Interrupt Enable */
#define ADC_CADRCIE_CLEAR_gc (0x00) /* C-ADC Regulator Current Interrupt Enable - CLEAR */
#define ADC_CADRCIE_SET_gc   (0x04) /* C-ADC Regulator Current Interrupt Enable - SET */


/* C-ADC Accumulated Current Interrupt Enable */
#define ADC_CADACIE_CLEAR_gc (0x00) /* C-ADC Accumulated Current Interrupt Enable - CLEAR */
#define ADC_CADACIE_SET_gc   (0x02) /* C-ADC Accumulated Current Interrupt Enable - SET */


/* C-ADC Instantaneous Current Interrupt Enable */
#define ADC_CADICIE_CLEAR_gc (0x00) /* C-ADC Instantaneous Current Interrupt Enable - CLEAR */
#define ADC_CADICIE_SET_gc   (0x01) /* C-ADC Instantaneous Current Interrupt Enable - SET */


/*
--------------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------------
*/


/* Band Gap Lock Enable */
#define BANDGAP_BGPLE_CLEAR_gc (0x00) /* Band Gap Lock Enable - CLEAR */
#define BANDGAP_BGPLE_SET_gc   (0x02) /* Band Gap Lock Enable - SET */


/* Band Gap Lock */
#define BANDGAP_BGPL_CLEAR_gc (0x00) /* Band Gap Lock - CLEAR */
#define BANDGAP_BGPL_SET_gc   (0x01) /* Band Gap Lock - SET */


/*
--------------------------------------------------------------------------------
LINUART - Local Interconnect Network
--------------------------------------------------------------------------------
*/


/* Software Reset */
#define LINUART_LSWRES_CLEAR_gc (0x00) /* Software Reset - CLEAR */
#define LINUART_LSWRES_SET_gc   (0x80) /* Software Reset - SET */


/* LIN Standard */
#define LINUART_LIN13_CLEAR_gc (0x00) /* LIN Standard - CLEAR */
#define LINUART_LIN13_SET_gc   (0x40) /* LIN Standard - SET */


/* LIN Configuration bits */
#define LINUART_LINCR_LCONF_gc(x) ((x<<4) & 0x30)

/* LIN or UART Enable */
#define LINUART_LENA_CLEAR_gc (0x00) /* LIN or UART Enable - CLEAR */
#define LINUART_LENA_SET_gc   (0x08) /* LIN or UART Enable - SET */


/* LIN Command and Mode bits */
#define LINUART_LINCR_LCMD_gc(x) (x & 0x07)

/* Identifier Status bits */
#define LINUART_LINSIR_LIDST_gc(x) ((x<<5) & 0xE0)

/* Busy Signal */
#define LINUART_LBUSY_CLEAR_gc (0x00) /* Busy Signal - CLEAR */
#define LINUART_LBUSY_SET_gc   (0x10) /* Busy Signal - SET */


/* Error Interrupt */
#define LINUART_LERR_CLEAR_gc (0x00) /* Error Interrupt - CLEAR */
#define LINUART_LERR_SET_gc   (0x08) /* Error Interrupt - SET */


/* Identifier Interrupt */
#define LINUART_LIDOK_CLEAR_gc (0x00) /* Identifier Interrupt - CLEAR */
#define LINUART_LIDOK_SET_gc   (0x04) /* Identifier Interrupt - SET */


/* Transmit Performed Interrupt */
#define LINUART_LTXOK_CLEAR_gc (0x00) /* Transmit Performed Interrupt - CLEAR */
#define LINUART_LTXOK_SET_gc   (0x02) /* Transmit Performed Interrupt - SET */


/* Receive Performed Interrupt */
#define LINUART_LRXOK_CLEAR_gc (0x00) /* Receive Performed Interrupt - CLEAR */
#define LINUART_LRXOK_SET_gc   (0x01) /* Receive Performed Interrupt - SET */


/* Enable Error Interrupt */
#define LINUART_LENERR_CLEAR_gc (0x00) /* Enable Error Interrupt - CLEAR */
#define LINUART_LENERR_SET_gc   (0x08) /* Enable Error Interrupt - SET */


/* Enable Identifier Interrupt */
#define LINUART_LENIDOK_CLEAR_gc (0x00) /* Enable Identifier Interrupt - CLEAR */
#define LINUART_LENIDOK_SET_gc   (0x04) /* Enable Identifier Interrupt - SET */


/* Enable Transmit Performed Interrupt */
#define LINUART_LENTXOK_CLEAR_gc (0x00) /* Enable Transmit Performed Interrupt - CLEAR */
#define LINUART_LENTXOK_SET_gc   (0x02) /* Enable Transmit Performed Interrupt - SET */


/* Enable Receive Performed Interrupt */
#define LINUART_LENRXOK_CLEAR_gc (0x00) /* Enable Receive Performed Interrupt - CLEAR */
#define LINUART_LENRXOK_SET_gc   (0x01) /* Enable Receive Performed Interrupt - SET */


/* Abort Flag */
#define LINUART_LABORT_CLEAR_gc (0x00) /* Abort Flag - CLEAR */
#define LINUART_LABORT_SET_gc   (0x80) /* Abort Flag - SET */


/* Frame Time Out Error Flag */
#define LINUART_LTOERR_CLEAR_gc (0x00) /* Frame Time Out Error Flag - CLEAR */
#define LINUART_LTOERR_SET_gc   (0x40) /* Frame Time Out Error Flag - SET */


/* Overrun Error Flag */
#define LINUART_LOVERR_CLEAR_gc (0x00) /* Overrun Error Flag - CLEAR */
#define LINUART_LOVERR_SET_gc   (0x20) /* Overrun Error Flag - SET */


/* Framing Error Flag */
#define LINUART_LFERR_CLEAR_gc (0x00) /* Framing Error Flag - CLEAR */
#define LINUART_LFERR_SET_gc   (0x10) /* Framing Error Flag - SET */


/* Synchronization Error Flag */
#define LINUART_LSERR_CLEAR_gc (0x00) /* Synchronization Error Flag - CLEAR */
#define LINUART_LSERR_SET_gc   (0x08) /* Synchronization Error Flag - SET */


/* Parity Error Flag */
#define LINUART_LPERR_CLEAR_gc (0x00) /* Parity Error Flag - CLEAR */
#define LINUART_LPERR_SET_gc   (0x04) /* Parity Error Flag - SET */


