stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* Power Reduction LIN UART Interface */
#define CPU_PRLIN_CLEAR_gc (0x00) /* Power Reduction LIN UART Interface - CLEAR */
#define CPU_PRLIN_SET_gc   (0x08) /* Power Reduction LIN UART Interface - SET */


/* Power reduction SPI */
#define CPU_PRSPI_CLEAR_gc (0x00) /* Power reduction SPI - CLEAR */
#define CPU_PRSPI_SET_gc   (0x04) /* Power reduction SPI - SET */


/* Power Reduction Timer/Counter1 */
#define CPU_PRTIM1_CLEAR_gc (0x00) /* Power Reduction Timer/Counter1 - CLEAR */
#define CPU_PRTIM1_SET_gc   (0x02) /* Power Reduction Timer/Counter1 - SET */


/* Power Reduction Timer/Counter0 */
#define CPU_PRTIM0_CLEAR_gc (0x00) /* Power Reduction Timer/Counter0 - CLEAR */
#define CPU_PRTIM0_SET_gc   (0x01) /* Power Reduction Timer/Counter0 - SET */


/* Clock Prescaler Change Enable */
#define CPU_CLKPCE_CLEAR_gc (0x00) /* Clock Prescaler Change Enable - CLEAR */
#define CPU_CLKPCE_SET_gc   (0x80) /* Clock Prescaler Change Enable - SET */


/* Clock Prescaler Select Bits */
#define CPU_CLKPR_CLKPS_gc(x) (x & 0x03)

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* External Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* External Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x02) /* External Interrupt Sense Control 0 Bit 1 - SET */


/* External Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_VAL_0x00_gc (0x00) /* Low Level of INTX */
#define EXINT_ISC00_VAL_0x01_gc (0x01) /* Any Logical Change of INTX */
#define EXINT_ISC00_VAL_0x02_gc (0x02) /* Falling Edge of INTX */
#define EXINT_ISC00_VAL_0x03_gc (0x03) /* Rising Edge of INTX */


/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x01) /* External Interrupt Request 0 Enable - SET */


/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x01) /* External Interrupt Flag 0 - SET */


/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/


/* Watchdog Timeout Interrupt Flag */
#define WDT_WDIF_CLEAR_gc (0x00) /* Watchdog Timeout Interrupt Flag - CLEAR */
#define WDT_WDIF_SET_gc   (0x80) /* Watchdog Timeout Interrupt Flag - SET */


/* Watchdog Timeout Interrupt Enable */
#define WDT_WDIE_CLEAR_gc (0x00) /* Watchdog Timeout Interrupt Enable - CLEAR */
#define WDT_WDIE_SET_gc   (0x40) /* Watchdog Timeout Interrupt Enable - SET */


/* Watchdog Timer Prescaler Bits */
#define WDT_WDP_VAL_0x00_gc (0x00) /* Oscillator Cycles 2K */
#define WDT_WDP_VAL_0x01_gc (0x01) /* Oscillator Cycles 4K */
#define WDT_WDP_VAL_0x02_gc (0x02) /* Oscillator Cycles 8K */
#define WDT_WDP_VAL_0x03_gc (0x03) /* Oscillator Cycles 16K */
#define WDT_WDP_VAL_0x04_gc (0x04) /* Oscillator Cycles 32K */
#define WDT_WDP_VAL_0x05_gc (0x05) /* Oscillator Cycles 64K */
#define WDT_WDP_VAL_0x06_gc (0x06) /* Oscillator Cycles 128K */
#define WDT_WDP_VAL_0x07_gc (0x07) /* Oscillator Cycles 256K */
#define WDT_WDP_VAL_0x08_gc (0x08) /* Oscillator Cycles 512K */
#define WDT_WDP_VAL_0x09_gc (0x09) /* Oscillator Cycles 1024K */


/* Watchdog Change Enable */
#define WDT_WDCE_CLEAR_gc (0x00) /* Watchdog Change Enable - CLEAR */
#define WDT_WDCE_SET_gc   (0x10) /* Watchdog Change Enable - SET */


/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */


/* Watchdog Timer Comfiguration Lock bits */
#define WDT_WDTCLR_WDCL_gc(x) ((x<<1) & 0x06)

/* Watchdog Timer Comfiguration Lock Enable */
#define WDT_WDCLE_CLEAR_gc (0x00) /* Watchdog Timer Comfiguration Lock Enable - CLEAR */
#define WDT_WDCLE_SET_gc   (0x01) /* Watchdog Timer Comfiguration Lock Enable - SET */


/*
--------------------------------------------------------------------------------
WAKEUP_TIMER - Wakeup Timer
--------------------------------------------------------------------------------
*/


/* Wake-up Timer Interrupt Flag */
#define WAKEUP_TIMER_WUTIF_CLEAR_gc (0x00) /* Wake-up Timer Interrupt Flag - CLEAR */
#define WAKEUP_TIMER_WUTIF_SET_gc   (0x80) /* Wake-up Timer Interrupt Flag - SET */


/* Wake-up Timer Interrupt Enable */
#define WAKEUP_TIMER_WUTIE_CLEAR_gc (0x00) /* Wake-up Timer Interrupt Enable - CLEAR */
#define WAKEUP_TIMER_WUTIE_SET_gc   (0x40) /* Wake-up Timer Interrupt Enable - SET */


/* Wake-up Timer Reset */
#define WAKEUP_TIMER_WUTR_CLEAR_gc (0x00) /* Wake-up Timer Reset - CLEAR */
#define WAKEUP_TIMER_WUTR_SET_gc   (0x10) /* Wake-up Timer Reset - SET */


/* Wake-up Timer Enable */
#define WAKEUP_TIMER_WUTE_CLEAR_gc (0x00) /* Wake-up Timer Enable - CLEAR */
#define WAKEUP_TIMER_WUTE_SET_gc   (0x08) /* Wake-up Timer Enable - SET */


/* Wake-up Timer Prescaler Bits */
#define WAKEUP_TIMER_WUTCSR_WUTP_gc(x) (x & 0x07)
#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE            _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR            _SFR_MEM8 (0x004C) /* SPI Control Register */
#define SPI_SPSR            _SFR_MEM8 (0x004D) /* SPI Status Register */
#define SPI_SPDR            _SFR_MEM8 (0x004E) /* SPI Data Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE         _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR         _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR         _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEAR         _SFR_MEM16(0x0041) /* EEPROM Read/Write Access */
#define EEPROM_EEARL        _SFR_MEM8 (0x0041) /* EEPROM Read/Write Access LOW BYTE */
#define EEPROM_EEARH        _SFR_MEM8 (0x0042) /* EEPROM Read/Write Access HIGH BYTE */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE           _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1          _SFR_MEM8 (0x0036) /* Timer/Counter Interrupt Flag register */
#define TC16_GTCCR          _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC16_TIMSK1         _SFR_MEM8 (0x006F) /* Timer/Counter Interrupt Mask Register */
#define TC16_TCCR1A         _SFR_MEM8 (0x0080) /* Timer/Counter 1 Control Register A */
#define TC16_TCCR1B         _SFR_MEM8 (0x0081) /* Timer/Counter1 Control Register B */
#define TC16_TCNT1          _SFR_MEM16(0x0084) /* Timer Counter 1  Bytes */
#define TC16_TCNT1L         _SFR_MEM8 (0x0084) /* Timer Counter 1  Bytes LOW BYTE */
#define TC16_TCNT1H         _SFR_MEM8 (0x0085) /* Timer Counter 1  Bytes HIGH BYTE */
#define TC16_OCR1A          _SFR_MEM8 (0x0088) /* Output Compare Register 1A */
#define TC16_OCR1B          _SFR_MEM8 (0x0089) /* Output Compare Register B */

/* TC0 - Timer/Counter, 16-bit (0x0000) */
/* TC16_BASE ALREADY DEFINED */
#define TC16_TIFR0          _SFR_MEM8 (0x0035) /* Timer/Counter Interrupt Flag register */
/* TC16_GTCCR ALREADY DEFINED */
#define TC16_TCCR0A         _SFR_MEM8 (0x0044) /* Timer/Counter 0 Control Register A */
#define TC16_TCCR0B         _SFR_MEM8 (0x0045) /* Timer/Counter0 Control Register B */
#define TC16_TCNT0          _SFR_MEM16(0x0046) /* Timer Counter 0  Bytes */
#define TC16_TCNT0L         _SFR_MEM8 (0x0046) /* Timer Counter 0  Bytes LOW BYTE */
#define TC16_TCNT0H         _SFR_MEM8 (0x0047) /* Timer Counter 0  Bytes HIGH BYTE */
#define TC16_OCR0A          _SFR_MEM8 (0x0048) /* Output Compare Register 0A */
#define TC16_OCR0B          _SFR_MEM8 (0x0049) /* Output Compare Register B */
#define TC16_TIMSK0         _SFR_MEM8 (0x006E) /* Timer/Counter Interrupt Mask Register */

