stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE         _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB         _SFR_MEM8 (0x0023) /* Port B Input Pins */
#define PORTBB_DDRB         _SFR_MEM8 (0x0024) /* Port B Data Direction Register */
#define PORTBB_PORTB        _SFR_MEM8 (0x0025) /* Port B Data Register */
#define PORTBB_PBOV         _SFR_MEM8 (0x00DC) /* Port B Override */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE         _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA         _SFR_MEM8 (0x0020) /* Port A Input Pins */
#define PORTAA_DDRA         _SFR_MEM8 (0x0021) /* Port A Data Direction Register */
#define PORTAA_PORTA        _SFR_MEM8 (0x0022) /* Port A Data Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE      _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR    _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status Register */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE            _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_ADSCSRA         _SFR_MEM8 (0x00E0) /* ADC Synchronization Control and Status Register */
#define ADC_ADSCSRB         _SFR_MEM8 (0x00E1) /* ADC Synchronization Control and Status Register */
#define ADC_ADCRA           _SFR_MEM8 (0x00E2) /* ADC Control Register A */
#define ADC_ADCRB           _SFR_MEM8 (0x00E3) /* ADC Control Register B */
#define ADC_ADCRC           _SFR_MEM8 (0x00E4) /* ADC Control Register B */
#define ADC_ADCRD           _SFR_MEM8 (0x00E5) /* ADC Control Register D */
#define ADC_ADCRE           _SFR_MEM8 (0x00E6) /* ADC Control Register E */
#define ADC_ADIFR           _SFR_MEM8 (0x00E7) /* ADC Interrupt Flag Register */
#define ADC_ADIMR           _SFR_MEM8 (0x00E8) /* ADC Interrupt Mask Register */
#define ADC_CADRCL          _SFR_MEM16(0x00E9) /* CC-ADC Regulator Current Comparator Threshold Level */
#define ADC_CADRCLL         _SFR_MEM8 (0x00E9) /* CC-ADC Regulator Current Comparator Threshold Level LOW BYTE */
#define ADC_CADRCLH         _SFR_MEM8 (0x00EA) /* CC-ADC Regulator Current Comparator Threshold Level HIGH BYTE */
#define ADC_CADIC           _SFR_MEM16(0x00EB) /* C-ADC Instantaneous Conversion Result */
#define ADC_CADICL          _SFR_MEM8 (0x00EB) /* C-ADC Instantaneous Conversion Result LOW BYTE */
#define ADC_CADICH          _SFR_MEM8 (0x00EC) /* C-ADC Instantaneous Conversion Result HIGH BYTE */
#define ADC_CADAC0          _SFR_MEM8 (0x00ED) /* C-ADC Accumulated Conversion Result */
#define ADC_CADAC1          _SFR_MEM8 (0x00EE) /* C-ADC Accumulated Conversion Result */
#define ADC_CADAC2          _SFR_MEM8 (0x00EF) /* C-ADC Accumulated Conversion Result */
#define ADC_CADAC3          _SFR_MEM8 (0x00F0) /* C-ADC Accumulated Conversion Result */
#define ADC_VADIC           _SFR_MEM16(0x00F1) /* V-ADC Instantaneous Conversion Result */
#define ADC_VADICL          _SFR_MEM8 (0x00F1) /* V-ADC Instantaneous Conversion Result LOW BYTE */
#define ADC_VADICH          _SFR_MEM8 (0x00F2) /* V-ADC Instantaneous Conversion Result HIGH BYTE */
#define ADC_VADAC0          _SFR_MEM8 (0x00F3) /* V-ADC Accumulated Conversion Result */
#define ADC_VADAC1          _SFR_MEM8 (0x00F4) /* V-ADC Accumulated Conversion Result */
#define ADC_VADAC2          _SFR_MEM8 (0x00F5) /* V-ADC Accumulated Conversion Result */
#define ADC_VADAC3          _SFR_MEM8 (0x00F6) /* V-ADC Accumulated Conversion Result */

/* BANDGAP - Bandgap (0x0000) */
#define BANDGAP_BASE        _SFR_MEM8 (0x0000) /* BANDGAP Base Address */
#define BANDGAP_BGCSRA      _SFR_MEM8 (0x00D1) /* Bandgap Control and Status Register A */
#define BANDGAP_BGCRB       _SFR_MEM8 (0x00D2) /* Band Gap Calibration Register B */
#define BANDGAP_BGCRA       _SFR_MEM8 (0x00D3) /* Band Gap Calibration Register A */
#define BANDGAP_BGLR        _SFR_MEM8 (0x00D4) /* Band Gap Lock Register */

/* LINUART - Local Interconnect Network (0x0000) */
#define LINUART_BASE        _SFR_MEM8 (0x0000) /* LINUART Base Address */
#define LINUART_LINCR       _SFR_MEM8 (0x00C0) /* LIN Control Register */
#define LINUART_LINSIR      _SFR_MEM8 (0x00C1) /* LIN Status and Interrupt Register */
#define LINUART_LINENIR     _SFR_MEM8 (0x00C2) /* LIN Enable Interrupt Register */
#define LINUART_LINERR      _SFR_MEM8 (0x00C3) /* LIN Error Register */
#define LINUART_LINBTR      _SFR_MEM8 (0x00C4) /* LIN Bit Timing Register */
#define LINUART_LINBRRL     _SFR_MEM8 (0x00C5) /* LIN Baud Rate Low Register */
#define LINUART_LINBRRH     _SFR_MEM8 (0x00C6) /* LIN Baud Rate High Register */
#define LINUART_LINDLR      _SFR_MEM8 (0x00C7) /* LIN Data Length Register */
#define LINUART_LINIDR      _SFR_MEM8 (0x00C8) /* LIN Identifier Register */
#define LINUART_LINSEL      _SFR_MEM8 (0x00C9) /* LIN Data Buffer Selection Register */
#define LINUART_LINDAT      _SFR_MEM8 (0x00CA) /* LIN Data Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE            _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0          _SFR_MEM8 (0x003E) /* General Purpose IO Register 0 */
#define CPU_GPIOR1          _SFR_MEM8 (0x004A) /* General Purpose IO Register 1 */
#define CPU_GPIOR2          _SFR_MEM8 (0x004B) /* General Purpose IO Register 2 */
#define CPU_SMCR            _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR           _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR           _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP              _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL             _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH             _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG            _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_CLKPR           _SFR_MEM8 (0x0061) /* Clock Prescale Register */
#define CPU_PRR0            _SFR_MEM8 (0x0064) /* Power Reduction Register 0 */
#define CPU_SOSCCALA        _SFR_MEM8 (0x0066) /* Slow Oscillator Calibration Register A */
#define CPU_SOSCCALB        _SFR_MEM8 (0x0067) /* Oscillator Calibration Register B */
#define CPU_DIDR0           _SFR_MEM8 (0x007E) /* Digital Input Disable Register */
#define CPU_PLLCSR          _SFR_MEM8 (0x00D8) /* PLL Control and Status Register */

