stevenj/avr-libc3/include/avr/io/atmega64hve2.h
/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE          _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR         _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR          _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK         _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR         _SFR_MEM8 (0x0068) /* Pin Change Interrupt Control Register */
#define EXINT_EICRA         _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK0        _SFR_MEM8 (0x006B) /* Pin Change Enable Mask Register 0 */
#define EXINT_PCMSK1        _SFR_MEM8 (0x006C) /* Pin Change Enable Mask Register 1 */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE            _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR          _SFR_MEM8 (0x0060) /* Watchdog Timer Control Register */
#define WDT_WDTCLR          _SFR_MEM8 (0x0063) /* Watchdog Timer Configuration Lock Register */

/* WAKEUP_TIMER - Wakeup Timer (0x0000) */
#define WAKEUP_TIMER_BASE   _SFR_MEM8 (0x0000) /* WAKEUP_TIMER Base Address */
#define WAKEUP_TIMER_WUTCSR _SFR_MEM8 (0x0062) /* Wake-up Timer Control and Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE           _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW            _SFR_MEM8 (0x0000) 
#define FUSE_HIGH           _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE        _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT     _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt 0 */
#define None_PCINT0_vect_num       (2)                 
#define None_PCINT0_vect           _VECTOR(2)          /* Pin Change Interrupt 0 */
#define None_PCINT1_vect_num       (3)                 
#define None_PCINT1_vect           _VECTOR(3)          /* Pin Change Interrupt 1 */
#define None_WDT_vect_num          (4)                 
#define None_WDT_vect              _VECTOR(4)          /* Watchdog Timeout Interrupt */
#define None_WAKEUP_vect_num       (5)                 
#define None_WAKEUP_vect           _VECTOR(5)          /* Wakeup Timer Overflow */
#define None_TIMER1_IC_vect_num    (6)                 
#define None_TIMER1_IC_vect        _VECTOR(6)          /* Timer 1 Input capture */
#define None_TIMER1_COMPA_vect_num (7)                 
#define None_TIMER1_COMPA_vect     _VECTOR(7)          /* Timer 1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (8)                 
#define None_TIMER1_COMPB_vect     _VECTOR(8)          /* Timer 1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (9)                 
#define None_TIMER1_OVF_vect       _VECTOR(9)          /* Timer 1 overflow */
#define None_TIMER0_IC_vect_num    (10)                
#define None_TIMER0_IC_vect        _VECTOR(10)         /* Timer 0 Input Capture */
#define None_TIMER0_COMPA_vect_num (11)                
#define None_TIMER0_COMPA_vect     _VECTOR(11)         /* Timer 0 Comapre Match A */
#define None_TIMER0_COMPB_vect_num (12)                
#define None_TIMER0_COMPB_vect     _VECTOR(12)         /* Timer 0 Compare Match B */
#define None_TIMER0_OVF_vect_num   (13)                
#define None_TIMER0_OVF_vect       _VECTOR(13)         /* Timer 0 Overflow */
#define None_LIN_STATUS_vect_num   (14)                
#define None_LIN_STATUS_vect       _VECTOR(14)         /* LIN Status Interrupt */
#define None_LIN_ERROR_vect_num    (15)                
#define None_LIN_ERROR_vect        _VECTOR(15)         /* LIN Error Interrupt */
#define None_SPI_STC_vect_num      (16)                
#define None_SPI_STC_vect          _VECTOR(16)         /* SPI Serial transfer complete */
#define None_VADC_CONV_vect_num    (17)                
#define None_VADC_CONV_vect        _VECTOR(17)         /* Voltage ADC Instantaneous Conversion Complete */
#define None_VADC_ACC_vect_num     (18)                
#define None_VADC_ACC_vect         _VECTOR(18)         /* Voltage ADC Accumulated Conversion Complete */
#define None_CADC_CONV_vect_num    (19)                
#define None_CADC_CONV_vect        _VECTOR(19)         /* C-ADC Instantaneous Conversion Complete */
#define None_CADC_REG_CUR_vect_num (20)                
#define None_CADC_REG_CUR_vect     _VECTOR(20)         /* C-ADC Regular Current */
#define None_CADC_ACC_vect_num     (21)                
#define None_CADC_ACC_vect         _VECTOR(21)         /* C-ADC Accumulated Conversion Complete */
#define None_EE_READY_vect_num     (22)                
#define None_EE_READY_vect         _VECTOR(22)         /* EEPROM Ready */
#define None_SPM_vect_num          (23)                
#define None_SPM_vect              _VECTOR(23)         /* SPM Ready */
#define None_PLL_vect_num          (24)                
#define None_PLL_vect              _VECTOR(24)         /* PLL Lock Change Interrupt */

/* Vector Table Size */
#define _VECTOR_SIZE               (4)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (25 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START            (0x0000)                                         
#define PROGMEM_SIZE             (0x10000)                                        
#define PROGMEM_END              (PROGMEM_START + PROGMEM_SIZE - 1)               

#define FLASH_START              (0x0000)                                         
#define FLASH_SIZE               (0x10000)                                        
#define FLASH_PAGE_SIZE          (0x0080)                                         
#define FLASH_END                (FLASH_START + FLASH_SIZE - 1)                   

#define BOOT_SECTION_1_START     (0xFC00)                                         
#define BOOT_SECTION_1_SIZE      (0x0400)                                         
#define BOOT_SECTION_1_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_1_END       (BOOT_SECTION_1_START + BOOT_SECTION_1_SIZE - 1) 

#define BOOT_SECTION_2_START     (0xF800)                                         
#define BOOT_SECTION_2_SIZE      (0x0800)                                         
#define BOOT_SECTION_2_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_2_END       (BOOT_SECTION_2_START + BOOT_SECTION_2_SIZE - 1) 

